Yu-Ting-Sun/yiki-m55m1/main.cpp
    if (label != NULL)
    {
        lastSeenMs = GetSystemTick_ms();

        if (strncmp(label, candUser, sizeof(candUser)) != 0)
        {
            strncpy(candUser, label, sizeof(candUser) - 1);
            candUser[sizeof(candUser) - 1] = '\0';
            candHits = 1;
        }
        else if (candHits < FILTER_SWITCH_HITS)
            candHits++;

        if (candHits >= FILTER_SWITCH_HITS &&
            strncmp(candUser, curUser, sizeof(curUser)) != 0)
        {
            strcpy(curUser, candUser);
            int n = Slideshow_SetFilter(curUser);
            printf("[FILTER] -> '%s' (%d album(s))\n", curUser, n);
        }
    }
    else if (curUser[0] != '\0' &&
             (GetSystemTick_ms() - lastSeenMs) > FILTER_CLEAR_MS)
    {
        curUser[0]  = '\0';
        candUser[0] = '\0';
        candHits    = 0;
        Slideshow_SetFilter(NULL);
        printf("[FILTER] -> all (nobody recognised for %u ms)\n",
               (unsigned)FILTER_CLEAR_MS);
    }
}
#endif /* RUN_FACE_RECOG && !RUN_FACE_ENROLL */

/*----------------------------------------------------------------------------
 * main
 *--------------------------------------------------------------------------*/
int main(void)
{
    BoardInit();          /* clocks, UART, HyperRAM map, SD mount, NPU init */

#if RUN_ESP_PROBE
    /* Must run before PerfTimer_Init(): the probe owns SysTick for delays. */
    esp_probe_run();      /* never returns */
#endif

    /* NOTE: no DWT register is read here anymore - touching DWT/CoreSight
     * without a live debug session hangs this board (standalone-reset bug). */
    if (PerfTimer_Init())             /* timing source: DWT, else SysTick */
        printf("[OK] timing source: DWT CYCCNT (cycle-accurate)\n");
    else
        printf("[OK] timing source: SysTick 64-bit (DWT disabled - see PerfTimer.h)\n");

#if RUN_DAY2_TESTS
    day2_test_run();      /* Wi-Fi + HTTP link validation; never returns */
#endif

#if RUN_DAY3_DEMO
    /* Day-3 demo: story rail + photo slideshow side by side. */
    if (Display_Init() == 0)
    {
        int d3 = day3_demo_run();
        if (d3 != 0)
            printf_err("Day-3 story failed (rc=%d) - running photos only\n", d3);

#if RUN_SD_SYNC
        /* Boot sync BEFORE the library scan and photo enrollment, so albums
         * and enroll files pushed from the App are picked up this boot. */
        if (SdSync_Run(true) > 0)
            printf("[MAIN] SD content updated from backend\n");
#endif

        Slideshow_ReserveRight(STORYUI_RESERVED_PX);
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);

        int slrc;

        if (Slideshow_LibScan(SLIDESHOW_DIR) < 0)
            slrc = -1;
        else
        {
#if RUN_CAMERA_PREVIEW
            /* Preview sits in the bottom-right corner of the photo region.
             * No camera (init fail) degrades to the plain slideshow. */
            bool     camOk = (Camera_Init() == 0);
            uint32_t camX  = Disaplay_GetLCDWidth() - STORYUI_RESERVED_PX - CAM_W;
            uint32_t camY  = Disaplay_GetLCDHeight() - CAM_H;
#if RUN_FACE_DETECT
            /* Face detection draws boxes onto the frame before it is blitted.
             * Init failure degrades to plain preview (no boxes). */
            bool fdOk = camOk && (FaceDetect_Init() == 0);
#if RUN_FACE_RECOG
            bool frOk = fdOk && (FaceRecog_Init() == 0);
#endif
#if RUN_FACE_ENROLL
            int  enrollSeen = 0;
#endif
            /* Single combined arena MPU setup (cacheable WTRA): the BSP
             * configures all app MPU regions in ONE InitPreDefMPURegion call,
             * so both arenas are set together here rather than per module. */
            if (fdOk)
            {
                ARM_MPU_Region_t rg[2];
                uint32_t nrg = 0;
                void    *aBase; uint32_t aSize;

                FaceDetect_GetArena(&aBase, &aSize);
                rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                nrg++;
#if RUN_FACE_RECOG
                if (frOk)
                {
                    FaceRecog_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
                }
#endif
                InitPreDefMPURegion(&rg[0], nrg);
            }

#if RUN_PHOTO_ENROLL && RUN_FACE_RECOG && !RUN_FACE_ENROLL
            /* Photo enrollment: scan 0:\faces for enroll_<label>.raw files,
             * run each through the identical detect/crop/embed pipeline as
             * if it were a camera frame, enroll, then rename it *.done.
             * (Names are collected first — renaming while f_readdir walks
             * the directory could disturb the iteration.) */
            if (fdOk && frOk)
            {
                static char names[PHOTO_ENROLL_MAX][40];
                int     nFound = 0;
                DIR     dj;
                FILINFO fno;

                if (f_opendir(&dj, "0:\\faces") == FR_OK)
                {
                    while (nFound < PHOTO_ENROLL_MAX &&
                           f_readdir(&dj, &fno) == FR_OK && fno.fname[0])
                    {
                        size_t n = strlen(fno.fname);
                        if (n >= sizeof(names[0]) ||
                            n < 12 ||                       /* enroll_x.raw */
                            strncmp(fno.fname, "enroll_", 7) != 0 ||
                            strcmp(&fno.fname[n - 4], ".raw") != 0)
                            continue;
                        strcpy(names[nFound++], fno.fname);
                    }
                    f_closedir(&dj);
                }

                for (int pi = 0; pi < nFound; pi++)
                {
                    char   label[24], rawPath[56], donePath[56];
                    size_t ll = strlen(names[pi]) - 7 - 4;
                    if (ll >= sizeof(label)) continue;
                    memcpy(label, &names[pi][7], ll);
                    label[ll] = '\0';

                    /* enroll_user1-2.raw -> user1 (extra reference photos) */
                    char *dash = strrchr(label, '-');
                    if (dash && dash[1])
                    {
                        bool digits = true;
                        for (char *p = dash + 1; *p; p++)
                            if (*p < '0' || *p > '9') digits = false;
                        if (digits) *dash = '\0';
                    }

                    snprintf(rawPath,  sizeof(rawPath),  "0:\\faces\\%s", names[pi]);
                    snprintf(donePath, sizeof(donePath), "0:\\faces\\%s", names[pi]);
                    memcpy(&donePath[strlen(donePath) - 4], ".done", 6);

                    FIL pf;
                    if (f_open(&pf, rawPath, FA_READ) != FR_OK)
                        continue;

