Yu-Ting-Sun/yiki-m55m1/main.cpp
                    uint16_t *frame = (uint16_t *)Camera_GetFrame();
                    UINT      br    = 0;
                    FRESULT   fr2   = f_read(&pf, frame, CAM_W * CAM_H * 2, &br);
                    f_close(&pf);

                    if (fr2 == FR_OK && br == CAM_W * CAM_H * 2)
                    {
                        FaceBox tb;
                        if (FaceDetect_Run(frame, CAM_W, CAM_H) > 0 &&
                            FaceDetect_GetTopBox(&tb))
                        {
                            if (FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb,
                                                 label) == 0)
                            {
                                f_unlink(donePath);
                                f_rename(rawPath, donePath);
                                printf("[PHOTO-ENROLL] '%s' enrolled from %s\n",
                                       label, rawPath);
                            }
                        }
                        else
                            printf("[PHOTO-ENROLL] no face detected in %s\n",
                                   rawPath);

                        Camera_Blit(camX, camY);   /* show photo + box briefly */
                    }
                    else
                        printf("[PHOTO-ENROLL] bad size in %s: read %u, want %u\n",
                               rawPath, (unsigned)br, (unsigned)(CAM_W * CAM_H * 2));
                }
            }
#endif
#endif
#endif

            for (;;)
            {
                slrc = Slideshow_ShowNext();
                if (slrc != 0) break;

#if RUN_SD_SYNC
                /* Periodic pull between photos: cheap manifest check; only
                 * albums whose version changed actually download. On fresh
                 * content, rescan the library so it enters the rotation. */
                {
                    static uint32_t s_lastSyncMs = 0;
                    uint32_t now = GetSystemTick_ms();

                    if (now - s_lastSyncMs >= SDSYNC_POLL_MS)
                    {
                        s_lastSyncMs = now;
                        if (SdSync_Run(false) > 0)
                        {
                            Slideshow_LibScan(SLIDESHOW_DIR);
                            continue;           /* show the new content now */
                        }
                    }
                }
#endif

                /* Hold window: this idle time is where the camera (and later
                 * the face-recognition inference) runs. */
                uint32_t t0 = GetSystemTick_ms();

                while ((GetSystemTick_ms() - t0) < SLIDESHOW_HOLD_MS)
                {
#if RUN_CAMERA_PREVIEW
                    if (camOk)
                    {
                        if (Camera_Capture() != 0)
                        {
                            camOk = false;      /* capture died: stop trying */
                            continue;
                        }

                        uint16_t *frame = (uint16_t *)Camera_GetFrame();

#if RUN_FACE_DETECT
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        const char *seenUser = NULL;
#endif
                        if (fdOk && FaceDetect_Run(frame, CAM_W, CAM_H) > 0)
                        {
                            FaceBox tb;
                            if (FaceDetect_GetTopBox(&tb))
                            {
#if RUN_FACE_RECOG
#if RUN_FACE_ENROLL
                                if (frOk && enrollSeen < ENROLL_SAMPLES)
                                {
                                    FaceRecog_Enroll(frame, CAM_W, CAM_H, &tb, ENROLL_LABEL);
                                    if (++enrollSeen >= ENROLL_SAMPLES)
                                        printf("[ENROLL] captured %d samples — done\n", ENROLL_SAMPLES);
                                }
#else
                                if (frOk && FaceRecog_Run(frame, CAM_W, CAM_H, &tb) == 1)
                                    seenUser = FaceRecog_GetLabel();
#endif
#endif
                            }
                        }
#if RUN_FACE_RECOG && !RUN_FACE_ENROLL
                        SlideFilter_Update(seenUser);
#endif
#endif
                        Camera_Blit(camX, camY);
                        continue;
                    }
#endif
                    Display_Delay(50);
                }
            }
        }

        printf_err("Slideshow could not run (rc=%d) - keeping story screen\n", slrc);
        for (;;) __WFI();     /* keep whatever is on screen; demo is over */
    }
    printf_err("Display_Init failed (check LCD panel define in board_config.h)\n");
#endif

#if RUN_SLIDESHOW && !RUN_DAY3_DEMO
    /* Photo-frame milestone: cycle SD-card photos on the LCD. Never returns
     * while it has photos to show; on failure fall through to the tests. */
    if (Display_Init() == 0)
    {
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);
        int slrc = Slideshow_Run(SLIDESHOW_DIR, SLIDESHOW_HOLD_MS);
        printf_err("Slideshow could not run (rc=%d) - continuing with tests\n", slrc);
    }
    else
    {
        printf_err("Display_Init failed (check LCD panel define in board_config.h) - continuing with tests\n");
    }
#endif

#if RUN_DAY1_TESTS
    printf("\n");
    printf("==============================================\n");
    printf(" M55M1 Dual-Model PoC - Day 1 Validation\n");
    printf("==============================================\n");
    printf(" HyperRAM   : FACE @0x%08X  GESTURE @0x%08X  slot=%u KB\n",
           (unsigned)FACE_MODEL_ADDR, (unsigned)GESTURE_MODEL_ADDR,
           (unsigned)(MODEL_SLOT_SIZE / 1024));
    printf(" arenas     : FACE %u KB @0x%08X | GESTURE %u KB @0x%08X (resident)\n",
           (unsigned)(FACE_ARENA_SZ / 1024),    (unsigned)(uintptr_t)FACE_ARENA_PTR,
           (unsigned)(GESTURE_ARENA_SZ / 1024), (unsigned)(uintptr_t)GESTURE_ARENA_PTR);

    bool t1 = test_load_both_models();

    setup_arena_mpu();    /* after load, before inference */

    /* Build both interpreters exactly once; they stay resident from here on. */
    printf("\n=== Interpreter Init (once per model) ===\n");
    init_model_once(faceModel,    MODEL_FACE,    FACE_ARENA_PTR,    FACE_ARENA_SZ,    "FACE");
    init_model_once(gestureModel, MODEL_GESTURE, GESTURE_ARENA_PTR, GESTURE_ARENA_SZ, "GESTURE");

    bool t2 = run_inference_bench(faceModel,    MODEL_FACE,    "FACE");
    bool t3 = run_inference_bench(gestureModel, MODEL_GESTURE, "GESTURE");
    bool t4 = test_alternating();

    /* ---- Summary mapped to the Day-1 success criteria ---- */
    printf("\n==============================================\n");
    printf(" Day-1 Summary\n");
    printf("==============================================\n");
    printf(" [%s] Both models load to non-overlapping addrs + CRC OK\n", t1 ? "PASS" : "FAIL");
    printf(" [%s] Face inference < 100 ms + output valid\n",            t2 ? "PASS" : "FAIL");
    printf(" [%s] Gesture inference < 100 ms + output valid\n",         t3 ? "PASS" : "FAIL");
    printf(" [%s] %d alternating switches, no crash, output valid\n",   t4 ? "PASS" : "FAIL", ALT_SWITCHES);
    printf(" Overall: %s\n", (t1 && t2 && t3 && t4) ? "DAY-1 PASS" : "NEEDS REVIEW");
    printf("==============================================\n");
    printf("=== All Tests Done ===\n");
#else
    printf("\n(Day-1 validation compiled out - RUN_DAY1_TESTS=1 to re-run; results in final_report.md)\n");
#endif /* RUN_DAY1_TESTS */

    while (1) { __WFI(); }
}
